module.exports = {
  tabWidth: 4, // Устанавливает ширину табуляции в 4 пробела
  useTabs: false, // Использует пробелы вместо табуляции
  bracketSpacing: true, // Добавляет пробелы между скобками объекта ({ foo: 'bar' } вместо {foo: 'bar'})
  semi: true, // Использует точку с запятой в конце строк
  singleQuote: true, // Использует одинарные кавычки вместо двойных
  trailingComma: 'es5', // Добавляет запятую в конце списков, если это допустимо в ES5
  jsxBracketSameLine: false, // Перенос закрывающей скобки JSX на новую строку
  arrowParens: 'always', // Оборачивает параметры стрелочных функций в круглые скобки
};
